var data = `贾敬寿辰之日，贾珍命贾蓉给老爷子送上等果品等十六大盒，然后在家中接待客人，贾琏贾蔷为第一波，找好玩的，被告知有戏班。次后邢夫人，王夫人，凤姐和宝玉到，解释贾母因昨晚多吃了桃子肠胃不舒所以没来。
王夫人等讨论秦氏病情，表示关心，然后尤氏安排吃饭。饭毕，大伙儿往园子里去看戏，凤姐和宝玉随贾蓉去看望秦氏。婶俩叙旧，宝玉回想起在这里午休梦游太虚幻境一事，又见到秦氏这般光景，听到她说未必熬的过年去，竟然不自觉落泪，凤姐怕宝玉惹秦氏不开心，多心思，劝宝玉到园子去。之后凤姐又劝慰了一番才罢，说定日后常来探望，也去往戏园子了。
路上见美景，文字也非常美，全文录下：
黄花满地，白柳横坡。小桥通若耶之溪，曲径接天台之路。石中清流激湍，篱落飘香，树头红叶翩翻，疏林如画。西风乍紧，初罢莺啼，暖日当暄，又添蛩语。遥望东南，建几处依山之榭，纵观西北，结三间临水之轩。笙簧盈耳。别有幽情，罗绮穿林，倍添韵致。
凤姐正欣赏时，猛然间从假山石后面走来一个人，问了，确定是贾瑞，但鬼鬼祟祟，眼神不住地觑看凤姐，凤姐便将他的用意猜透八九分，心想几时有机会让他死在我的手里。
再后来就是点戏听戏，吃了晚饭各自散去。贾瑞仍惦念着琏二嫂子，去荣府找了好几次都不得见。冬至，贾母等人又讨论秦氏病情，很担忧，让凤姐多去看看。
王熙凤听平儿说贾瑞又来几次，下定狠心要整他。`