var data = `正说话时，有人回说瑞大爷又来了，凤姐急命人客客气气地请进来，假意殷勤，让茶让座，闲聊之后凤姐约贾瑞晚上起了更后来到西边穿堂等候，贾瑞如获珍宝，喜不自胜。
晚上，贾瑞趁掩门时抹黑钻入穿堂，白白被冻了一夜，回家被教养甚严的祖父打了几十板，罚风地里饿肚子读文章，痛苦不堪。
贾瑞仍然死心不改，万万想不到凤姐是在捉弄他，过几天又去找凤姐。凤姐这回又告诉他去房后空屋子里等，然后派兵点将设下圈套，只等瑞大爷上钩。
夜晚，贾蔷和贾蓉两个一个假扮凤姐，一个负责捉奸，拿住之后贾瑞羞愧不堪，又被二人勒索写了各五十两的欠条。这还没算完，两个人又设计给贾瑞泼了迎头满身的冰冷屎尿粪……(这整人的招数也真够绝了。)
之后，贾瑞仍然淫心动荡，满心想凤姐，再加上两次在寒冬腊月里挨冻，身心俱疲，另加上贾蓉贾蔷两个狠心的常常来索要银两，如此三五下里几面夹攻，居然大病一场，吃了几十斤的药也不见好，家里找凤姐借独参，凤姐却谎称没有了，只给了几钱渣末。贾瑞求生心切，无药不吃，却白白花钱不见效。某日有个跛足道人来化斋，告诉贾瑞这病无药可医，但有个宝贝送他可保命，取出一面镜子给他，说是太虚幻境警幻仙子制的风月宝鉴，警告他切记只可以照反面，不能照正面，三日后他再来收取镜子，贾瑞就好了。
偏这贾瑞不听话，先看反面，是一骷髅，吓了一跳，又忍不住翻看正面，居然是王熙凤，他淫心不改，心中欢喜，进入镜子去与凤姐云雨，如此三四次后，有两个人突然拿铁锁套住他，之后便再不能说话，一命呜呼。
贾代儒夫妇哭的死去活来，觉得是镜子害了孙子，要拿火去烧，镜子说是你们自己以假为真，何苦烧我？跛足道人及时赶到把镜子救走了。
家里丰丰富富地料理了贾瑞丧事。谁知这年冬底，林如海书信说身染重疾，要黛玉回去，宝玉舍不得，但父女之情也不好阻拦，贾母要求贾琏送黛玉去，于是贾琏与黛玉速择了日期登舟往扬州去。`