var data = `宁国府下人们为凤姐接管内事议论纷纷。凤姐命彩明登记造册，查看家口花名册。
次日，卯正二刻，各处人等皆到齐等候凤姐分派。王熙凤逐个看完花名册，开始分工，细化并明确权责，落实到个人，谁出问题谁负责解决。然后定好规矩，要求每个人随身带钟表严格守时，人，事，物通通清晰明了，不容许一个浑水摸鱼，滥竽充数。
经过此番整肃，宁府中一应事务井井有条，忙而不乱，之前的慌乱，推脱，偷闲，偷窃，以公谋私等流弊次日一概都没了。凤姐这管理才能真是堪称模范。
凤姐见自己威重令行，心中十分得意。见尤氏和贾珍都或病或哀伤过度，都不大饮食，凤姐就每日派人送些精细饭食来劝慰。
这一天，凤姐料定人客不少，就早早地来理事，查点名册，发现只有一个迎亲送客的没到，即命传来，那人解释说原本醒早了，结果又睡着，所以迟了，求告饶过这一次。这时，王兴媳妇和荣国府一些人来找办事，先处理了这些，然后发落这个睡过头的，杀鸡儆猴，喝命拉出去打二十板，众人自此更加不敢苟且偷安，以后更加兢兢业业。
宝玉秦钟来找凤姐，正闹着，有人回说林黛玉父亲林如海于九月初三在扬州病逝，贾琏带林黛玉送灵柩去苏州老家，大约到年底才能回来。宝玉听了担心黛玉近日不知道该如何悲伤了，皱眉长叹。
一切顺利，临近发丧之日，凤姐更加尽心尽力，日夜不暇以确保无虞。宝珠行未嫁女之礼，尽哀。官客送殡的，有镇国公牛清之孙，理国公柳彪之孙，齐国公陈翼之孙，治国公马魁之孙，修国公侯晓明之孙，另缮国公因诰命亡故守孝而没来人，其余王孙公子不可胜数，送殡队伍浩浩荡荡摆出了三四里远。
走不多时，见各家路祭，东南西北各王为首。其中北静王水溶未及弱冠，为人谦和，形容秀美，不以王位自居，亲自来送。贾府盛情施礼，北静王要求见贾宝玉，二人见时相互欣赏。此回完。`