var data = `宝玉到院外，贾政的小厮们借机把宝玉身上的配饰物能解的都解了去，然后见过贾母，告诉她情况，让其安心。
回到住处，袭人倒茶，黛玉听说东西都没了就过来瞧，结果认为自己送的香囊也丢了，就赌气回去把一个宝玉央求她做的未完工的新香囊拿过来剪碎。宝玉知道这个香囊费了不少的功夫，赶紧过来救，却已经晚了，宝玉把衣领解开，从里面红袄衣襟上取下来黛玉送的香囊，反问，看看，我哪里把你做的东西随便给人了？
黛玉一看，真是误会了，后悔自己莽撞，又悔又气，躺在床上抹泪，两个人相互斗气，最终自己和解。
然后去王夫人那里，发现非常热闹，薛姨妈宝钗都在，贾蔷去姑苏买的女孩子已经到，被安置到梨香苑，薛姨妈搬到了东北更幽静的一个房舍住。
之后林之孝来回，介绍了妙玉的基本情况，王夫人提议将妙玉接过来住。接着准备省亲的各处活计都忙得不亦乐乎。
转眼元宵就在眼前了，所有准备工作都已停当，前一夜所有人都没有睡觉。
元宵节早早地准备迎接，结果到晚上才来。省亲场面浩荡奢华，仪式隆重，非言语能形容得尽。仪礼完毕，众人游赏芳园，在元春主持下题匾额名字，对联，赋诗，宝玉被要求做出五首诗，宝钗帮改一字，黛玉帮写两首，其中杏帘在望被称赞高出众姐妹。
贾蔷带领戏官演戏，龄官被关注，得赏识。
最后是为众人封赏，谢恩，时间到，太监请贵妃起驾回銮，元春与母亲，祖母不忍分别，却也难违皇家规范，含泪告别。`