var data = `贾妃回宫，次日见驾谢恩，龙颜甚悦，又对后宫及贾府大加赏赐。荣宁两府为省亲一事人人精疲力尽，完事之后大观园的收拾整理就用了两三天，凤姐事多任重，宝玉则无事最为闲暇，受贾珍邀请去看戏去了。
宝玉不喜热闹，一个人去了曾经待过的有美人画的小书房，结果撞见茗烟和一个女孩正偷偷行苟且之事，宝玉好心将他们放过。看戏无聊，宝玉和茗烟商议出去到袭人家里看看。
花家好生招待，袭人担心被发现，早早地请宝玉回去。宝玉将元妃所赐之糖蒸酪留给喜吃此物之袭人。李嬷嬷赌气吃尽了那份酥酪。袭人推说爱吃栗子，使宝玉把酥酪丢开，宝玉给袭人剥栗子。袭人以家人要将她赎回的说法来试探宝玉，实际上并没有回去的意思，宝玉信以为真，百般挽留，还答应了袭人“不许说狠话，要好好读书，不可再毁僧谤道，不要再爱红，吃胭脂“等三四件事。
 宝玉脸上带着胭脂膏子去看黛玉。黛玉说自己很困，想休息，宝玉不肯，还要和她同一个枕头歇着。然后两个人对着脸斜躺着说话。宝玉惊讶黛玉身上的幽香，黛玉说，自己有俗香，无罗汉真人给的香，又说奇香、暖香、冷香之类的话来影射宝钗与宝玉金玉良缘之说。宝玉怕黛玉睡出病来，就胡诌耗子精盗香芋的故事给黛玉听，哄她不要再睡着了。正玩笑间，宝钗来了，讥笑宝玉忘了芭蕉诗，急的满头汗，这会儿又记性好了。`