var data = `宝玉正在黛玉房中说笑，宝钗撞来，一起谈笑，赶走了黛玉的困意，忽然听到宝玉房中吵嚷起来，他们仔细听了听，知道是宝玉的奶妈李嬷嬷在数落袭人。
宝玉要过去劝解，宝钗提醒不要和老人家吵，要让她一步。李嬷嬷赌博的时候输了钱，正愁没地方撒气，来到宝玉房里却发现袭人躺着不理她，越发的气氛就把心中的怒火全部撒到了袭人的身上。李嬷嬷和袭人各自委屈痛哭，宝玉左右为难，宝钗黛玉过来，李嬷嬷拉住她们唠叨个不停。
这时刚巧王熙凤过来，一番好话将李嬷嬷请去，黛玉等人拍手赞赏，多亏这阵风来，把个老婆子给弄去了。
袭人躺下休息静养。其余人都去玩了，屋里只剩下麝月和宝玉，宝玉为麝月篦头，亲密的举动引得晴雯吃醋，但为了玩牌也没理他们，后宝玉睡去。
第二天，宝玉到薛姨妈那里去，恰巧碰见贾环找宝钗玩，输了钱正和莺儿耍赖，宝玉见状就将贾环训斥了一番，贾环委屈地走了。回去后，就向母亲赵姨娘诉苦，没想到母亲非但没有安慰，还恶狠狠地骂了他。正巧被王熙凤听见，王熙凤挺不过，便将贾环叫了出来，指桑骂槐的把赵姨娘骂了一顿，带着贾环走了。赵姨娘虽很生气，但平日里她一直怕着王熙凤，不敢说什么。之后凤姐还教训了贾环一番。
这时史湘云来了，宝玉和宝钗两个忙到贾母房中，黛玉看见宝玉从宝钗那来，便又不自在起来，到了后来，便又落泪，急的宝玉哄了好一阵才好。就在这个时候，湘云窜出，说宝玉只与黛玉玩，不管她，黛玉就拿起湘云的大舌头来取笑，湘云也不示弱，说黛玉不敢挑宝钗的毛病，并要她将来找一个咬舌头的林姐夫，整天听“爱”“厄”去。`