var data = `贾琏和凤姐商量宝钗的生日如何办，按照谁的惯例去做不好确定，又知道贾母非常看重，不可不谨慎。
贾母说捐资二十两为宝钗生日会置办酒戏，凤姐一席话把大家逗乐，贾母也非常开心。二十一日宝钗生日当天，搭了戏台，昆弋两腔，贾母让宝钗先点，宝钗就顺着贾母所喜点了《西游记》，之后凤姐《刘二当衣》，黛玉，宝玉，湘云，迎春探春惜春，李纨等依次点了。酒席开始，宝钗又点了一出《山门》，宝玉没听过，让宝钗解释，听了戏文赞赏不已，黛玉骂他疯癫了。
贾母爱其中的小旦和小丑，原是十来岁的孩子，给了封赏，然后凤姐提出一个话茬，说那个小旦很像我们身边一个人，其实大家都看出来了，但就是不好说出来，结果史湘云口无遮拦，说像林妹妹，宝玉一听赶紧瞅了一眼湘云，给她使眼色，结果好心没好报，却被误会，众人于是都说真像。
湘云当晚就命小丫头收拾衣服，次日一大早就走，显然是生气赌气呢。宝玉上前去解释为她着想，结果二人的谈话偏又被黛玉听到，这下宝玉越描越黑，把两个妹妹都给招惹得罪了，且还不自知。借湘云之口对黛玉的性情进行了小结，小性，多心，爱气恼，与宝玉互相伤害。
宝玉也闷闷的回去赌气。黛玉发现这回宝玉如此果断回去，不放心，过一会儿以寻袭人为由跟过去探探情况，袭人让她看了宝玉睡前写的偈语，顿时明白了，并拿回去次日给宝钗，湘云看。三人一起去解劝宝玉，黛玉讲了五祖传衣钵的故事，让宝玉明白自己还有很多不知晓的东西，劝其放弃参禅悟道之路。
然后就是元妃从宫中传来灯谜，大家猜了并另制灯谜反馈写纸条贴灯上送回宫中，大家玩灯谜游戏很有兴致，贾政也来凑热闹，猜儿女们灯谜，最后一个却觉悲戚，垂头沉思。贾母见他神色不对，怕是劳乏，又担心令姐妹们拘束，就让他回去了，父亲离开以后，贾宝玉开始大显身手去评头论足了。


这些灯谜好像都是在暗示什么，暂时还没太明白。`