var data = `次日贾母仍领着众人过节。元妃回去后命将那日所有的题咏都让探春依次誊抄，自己亲自编次，又命在大观园勒石，因此贾政命人各处去选拔精工名匠磨石镌字，贾珍率贾蓉贾蔷等监工。
贾政想把玉皇庙达摩庵的小沙弥小道士从大观园搬出，分发到各庙去，后街贾芹之母一直想为儿子谋个差使，刚巧听说此事，便去求告凤姐，凤姐让贾琏帮忙成全了贾芹。
元妃回去后因怕大观园寥落，辜负了园中景致，竟命令宝玉与诸姐妹搬进去居住。贾政在众人入园之前百般叮嘱宝玉要在园中安分，好好读书写字。期间问及袭人的名字，贾政觉得刁钻，骂宝玉不务正业，但又没让改。
宝玉从此每天与姐妹们一起读书写字、下棋吟诗，心满而意足比如写的几首即事诗，也是真情真景。 三月桃花开时，宝玉拜茗烟所赐，在大观园里偷偷阅读《西厢记》，因一阵风，书上的词“落红成阵”在他身边应验显现，桃花片片吹落身边，宝玉不忍心这些娇嫩的花儿被脚步践踏了，因此因此用衣服兜起来放于流水中，真真的落花流水……后黛玉来了，问宝玉做什么，然后告诉他花放在水里也不能干净，不如把它们扫了拿土埋了，以后随土化了，更加干净，这是葬花。
黛玉后来发现宝玉读的是《西厢记》，于是也认真阅读记诵起来。二人还各借《西厢记》词句表白、打趣。宝玉自比张生(我就是个“多愁多病的身”)，比黛玉为莺莺(你就是那“倾国倾城的貌”)；黛玉含羞嗔怒之极，说宝玉是“银样蜡枪头”。葬过落花，宝玉被袭人叫走。黛玉一人闷闷回房的路上，细想着“如花美眷，似水流年”的真义，竟又听到了《牡丹亭》妙词妙曲，不禁心痛神弛，眼中落泪。`