var data = `接上回，小红做了一场和贾芸的梦，醒来之后一夜无眠。宝玉见了小红，也留了心，但怕别人多心，也不了解小红为人，因此想和她拉进又没有行动。此后小红便闷闷不乐，大家都以为她身子不舒服，也就不多理会。
贾环被王夫人要求在屋里抄经，丫鬟们素日便不喜欢他，不爱搭理他，只有彩霞愿意和他说话。之后宝玉来了，宝玉形象光彩照人，无论在哪里都众星捧月一般，因此贾环心生妒忌。宝玉和彩霞闹着玩，贾环趁机故意将一碗蜡烛油泼向宝玉的脸，满脸满身都是热油，脸被烫出了一大串泡！凤姐赶紧一边上前帮宝玉收拾，一边和贾母一起骂贾环和赵姨娘黑心东西。
宝玉寄名的干娘马道婆骗得贾母每日五斤油供奉菩萨，保宝玉无灾。赵姨娘给马道婆说这一分家私要不都叫凤姐搬送到娘家去，“我也不是个人”。并叫马道婆设法绝了王熙凤和宝玉，“这家私不怕不是我环儿的”。给马很多首饰等物做抵押，并写五十两欠契一张。马给了纸铰的十个鬼和两个纸人。
凤姐给黛玉等送暹罗国进贡的茶叶，取笑说黛玉给她家作媳妇，黛玉骂她贫嘴贱舌讨人嫌。凤姐、黛玉正眼不看赵姨娘。后来果不其然，宝玉和凤姐先后脚一齐发疯，糊涂发烧。眼看着病情越来越严重，贾赦为二人寻僧觅道，贾政劝而不住。赵姨娘假慈悲地叫贾母给宝玉办后事，被贾母连贾政一起骂了一顿。后来多亏跛足道人来救，说宝玉身上的玉就是解救之物，持诵“宝玉”使其灵验，宝玉和凤姐病愈，黛玉念佛，宝钗说如来佛管林姑娘姻缘，黛玉骂钗与凤一样是贫嘴烂舌。
`