var data = `宝玉养过了三十三天之后，果然如跛足道人所说，身体恢复强壮，而且脸上的创痕也恢复如常了，于是又回到大观园中去。
宝玉生病这段日子，贾芸昼夜在这里坐更看守，小红也守着宝玉，渐渐相互都混熟了。红玉和佳蕙私下里讨论自己地位低被歧视的处境，佳蕙动情处非常伤心，痛哭起来，小红劝慰她大家相守不过三五年的光景，过后谁还顾得了谁，千里搭长棚，没有不散的宴席。
宝玉传贾芸来，说了些没要紧话。贾芸通过坠儿掉换了小红丢失的罗帕，并了解到宝玉房里的各个丫鬟情况。
宝玉闲着无聊，来到“凤尾森森，龙吟细细”的潇湘馆。宝玉用《西厢记》中词曲相戏黛玉，黛玉变了脸，说宝玉拿她取笑。
薛蟠以贾政名义骗宝玉出来吃他生日的藕、瓜、鲟鱼、熏暹猪等。薛蟠问宝玉明儿自己生辰，打算送什么礼物来，宝玉说没什么新鲜的东西，就提到用心做点字画，薛蟠顺势说起自己看过一幅自觉非常好的画，上面还有好多字，落款写着”庚黄”，宝玉想了半天，最后拿起笔写了两个字，问薛蟠是不是这两个字，众人一看大笑起来，原是“唐寅”，事后宝钗说宝玉吃了她家的新鲜东西了。
黛玉听说宝玉去见贾政，心中也担忧，于是晚饭后来看宝玉，结果晴雯没听出来是黛玉，以为是别的小丫头就不给开门，又听到宝钗宝玉一起说笑，气上加气，黛玉不禁想起自己身世，又黯然神伤起来，独立于墙边花阴之下，也顾不得风寒伤身，忍不住悲悲戚戚，泪珠连连，凄伤之感令鸟儿都不忍听下去。

颦儿才貌世应稀，独抱幽芳出绣闱。幽咽一声犹未了，落花满地鸟惊飞。`