var data = `同僚张如圭告知京都起复旧员的消息，冷子兴献计，借林如海之口求贾政荐书。
林如海同意，正巧黛玉祖母贾母邀请外孙女到贾府去，便同意贾雨村护送黛玉一同前往贾府。贾政见贾雨村并尽力帮忙，贾雨村因此顺利得以复任，成为应天府尹。
下面为黛玉进贾府，步步留心，时时在意，不肯轻易多说一句话，多行一步路，恐人耻笑。借林黛玉的一双眼睛来描绘荣宁二府之盛况。后黛玉拜见贾母，祖孙真情相拥而泣，再拜见大舅母二舅母，先珠嫂子等，过一会儿又见迎春探春惜春三姊妹。
下一个见的重要人物是王熙凤，未见其人，先闻其声，粉面含春威不露，丹唇未启笑先闻，肖像描写传神生动，做了三件事，陪哭，问学，安置住处，处处体现出她的精明，一切为讨好贾母，并彰显自身地位。
贾母命人带黛玉去见两位舅舅，结果均未成，贾赦避而不见，推辞逃脱，贾政却因斋戒不在。最后出场的是贾宝玉，晚饭之后，宝玉回来，借黛玉眼睛描公子神采，天然一段风韵，全在眉梢，平生万种情思，悉堆眼角，然后又由宝玉之眼来观黛玉，两弯似蹙非蹙罥烟眉，一双似喜非喜含情目，态生两靥之愁，娇袭一身之病，泪光点点，娇喘微微，娴静时如娇花照水，行动处似弱柳扶风，心较比干多一窍，病如西子胜三分。二人一见如故，像在哪里见过，就当远别重逢。
最后，宝玉因为黛玉回答没有玉，而怒摔自己的通灵宝玉，贾母谎言安慰才罢休，黛玉开始哭哭啼啼，此时宝玉贴身侍女花袭人出场，介绍她的来历性情等。最后一段提到薛蟠命案，为下回张本，吸引听书人兴趣。`