var data = `周瑞家的送完刘姥姥去王夫人处回话，被告知王夫人去薛姨妈那里拉家常了，便去往梨香苑，王，薛聊天正酣，不便打扰，周瑞家的便去找薛宝钗，因提到宝钗近日惹病，二人聊病情与吃的药，先天热毒导致反复发病喘嗽，配冷香丸，这个药方着实奇特：春白牡丹，夏白荷花，秋白芙蓉，冬白梅花各十二两，于次年春分晒干，又要雨水之日雨水，白露之日露水，霜降之日白霜，小雪之日白雪各12钱，调匀和药，再加蜂蜜和白糖各十二钱制成龙眼大的药丸，这个癞头和尚给的药方如此奇巧，却在之后一两年之内全都实现了，可见自是有天相助。
之后回完王夫人，无事，退出，却被薛姨妈叫住，让给姑娘们送宫花，走出门遇见金钏，周瑞家的和金钏打听香菱之事，问香菱出身与年龄，一概不知。
因迎春探春惜春三姐妹已经转移到王夫人房后居住，于是周瑞家的就乘地利之便先给这三个丫头送去，送花时看到迎春探春正在下棋，而惜春却和小尼姑智能儿一处玩耍，且说明儿也剃了头和智能儿一同去做姑子呢，这里暗示了后来惜春的命运。
之后去凤姐处，孰料贾琏夫妇正在云雨之欢，周会意，平儿代替收了，然后又被指示送还两支来转送给蓉大奶奶。
最后才到贾母那里，此时看到她女儿回来，忧愁，知女婿遇事了需要帮忙。周答应之后去给黛玉送花，黛玉正和宝玉一起玩九连环，黛玉听说自己的花是最后被送到的，就挑剔吃醋，说被别人挑拣剩下的给她，其实是她自己过于敏感的自尊心在作怪。
周瑞女婿原来就是冷子兴，因和人打官司，叫女人来贾府讨情分。凤姐向王夫人回话，说甄家送东西来，如何如何回礼，并请示次日去赴珍大嫂子之邀，王夫人应允。
次日，王熙凤去辞贾母，被宝玉看到了，宝玉也央求着要去，于是就带上了他。秦氏带了偏女性化，柔柔弱弱的弟弟秦钟来，宝玉和秦钟一会面便互相爱慕，心下盛赞对方，说上几句话就愈加亲密起来。两人惺惺相惜，商议秦钟来贾府的私塾和宝玉一起读书，因二人志同道合，臭味相投。
吃过晚饭天黑，派人送秦钟回去，结果派错了人，焦大仗着之前的功绩目中无人，无法无天，透出宁府对下人疏于管理的信息。焦大继续乘醉哭闹，凤姐提议整治这样的奴才。
结语：不因俊俏为朋友，正为风流始读书。<blockquote>问题：</blockquote><blockquote>1.宝钗与黛玉是否合体？本章介绍的宝钗之疾似乎与黛玉的相似，只是处理方式不同。</blockquote><blockquote>2.秦钟承担着什么样的角色？</blockquote>欢迎讨论，谢谢您的支持！`