var data = `宝玉和凤姐回家，宝玉先去找贾母请示延请秦钟来家塾一起读书，贾母喜悦。凤姐请贾母去宁府看戏。
看戏回来，贾母午休，宝玉无聊，想起宝钗近日生病，于是就想去探望一番。为避免被父亲发现训斥，绕远道去了梨香苑，探问宝钗病情。描绘宝钗形容：唇不点而红，眉不画而翠，脸若银盆，眼如水杏，罕言寡语，人谓藏愚，安分随时，自云守拙。宝钗赏鉴宝玉之玉：大如雀卵，灿若明霞，莹润如酥，五色花纹缠护，正面有字“莫失莫忘，仙寿恒昌”，莺儿说这两句话和宝钗金锁的话是一对。然后宝玉就要看金锁，正反面分别刻着四个篆字：不离不弃，芳龄永继。
<div class="image-package">
<div class="image-container" style="max-width: 700px; max-height: 700px;">
<div class="image-container-fill" style="padding-bottom: 100.0%;"></div>
<div class="image-view" data-width="3016" data-height="3016"><img data-original-src="//upload-images.jianshu.io/upload_images/2121856-e638b4c6fa794002.jpg" data-original-width="3016" data-original-height="3016" data-original-format="image/jpeg" data-original-filesize="1388324"></div>
</div>
<div class="image-caption">图片发自简书App</div>
</div>宝钗自解释说是癞头和尚让写的，此时宝玉闻到一股幽香，宝钗解释为冷香丸的香气未散。
一语未了，外面人报林黛玉来访，见宝玉在，就打趣来的不巧了，不应该扎堆来，一个一个的瞧，避免某一天太过热闹或者太过冷清。外面天冷下雪，薛姨妈请儿女们一起在家吃酒，宝玉宝钗讨论吃热酒冷酒利弊，钗说服宝玉不再吃冷酒。
黛玉小丫鬟雪雁来送小手炉给姑娘，黛玉趁机借题发挥，嗔怪雪雁听紫娟话却不听自己的，实则言外之意是奚落宝玉听宝钗言而不听自己，呼应回目标题，黛玉半含酸。
宝玉喝酒正在兴头上，李嬷嬷又上来阻拦，黛玉和她斗嘴舌，自然不在话下，李嬷嬷无趣，借故回家了。
酒后吃晚饭，饭毕宝玉黛玉回家，晴雯抱怨替宝玉贴斗方劳心费力，袭人装睡，宝玉问早上送给晴雯的豆腐皮包子，人说李嬷嬷拿走给孙子了，茜雪递茶，宝玉问早上的枫露茶哪里去了，又是李嬷嬷吃了，于是发火摔碎了杯子，袭人忙起来劝慰。
第二天，秦钟来拜贾母，贾母喜欢秦钟，最后介绍秦钟父亲秦业，及秦钟来贾府私塾的背景。末尾：早知日后争闲气，岂肯今朝错读书。
问：莺儿露了什么意？`