var data = `却说惜春正在那里揣摩棋谱，鸳鸯走了进来，原来贾母八十一大寿要超经，惜春都答应了。
鸳鸯遂辞了出来，同小丫头来至贾母房中，回了一遍。 贾母与李纨打双陆，鸳鸯旁边瞧着。李纨的骰子好，掷下去把老太太的锤打下了好几个去。鸳鸯抿着嘴儿笑。忽见宝玉进来，手中提了两个细蔑丝的小笼子，笼内有几个蝈蝈儿，说道:“我听说老太太夜里睡不着，我给老太太留下解解闷。”贾母笑道:“你不在学房里念书，为什么又弄这个东西呢。”宝玉道:“不是我自己弄的。今儿因师父叫环儿和兰儿对对子，环儿对不来，我悄悄的告诉了他。他说了，师父喜欢，夸了他两句。他感激我的情，买了来孝敬我的。我才拿了来孝敬老太太的。”
贾珍正在厢房里歇著，听见门上闹的翻江搅海。叫人去查问，原来是鲍二和周瑞的干儿子打架。”贾珍十分气愤，忙令众人将他们捆起。这时，贾琏也回来了，又添了人去拿周瑞。周瑞知道躲不过，也找到了。贾珍便叫都捆上。贾琏把周瑞踢了几脚。又喝命人把鲍二和何三各人打了五十鞭子，撵了出去。下人背地里便生出许多议论来:也有说贾珍护短的，也有说不会调停的，也有说他本不是好人，人多嘴杂，纷纷不一。
贾芸给王熙凤送东西，凤姐不收，小红见贾芸没得彩头，也不高兴，拿着东西跟出来。贾芸接过来，打开包儿拣了两件，悄悄的递给小红，小红只得收下。`