var data = `恋风流情友入家塾，起嫌疑顽童闹学堂
宝玉选择后日开始上学，通知秦钟到家里来一起前往学堂。宝玉临走时，袭人闷闷不乐，然后告诫宝玉尽心于事功，好好念书，保重身体，并将日常衣用给小子们交代周全，之后宝玉去见贾母，贾政，王夫人等，贾政骂宝玉贪玩，嘱咐跟宝玉的李贵要催促宝玉好好读书，不要学一些精致的淘气，尽胡闹了，言辞其实有些威胁恐吓之意。贾政还要求宝玉改念四书。
辞完贾母，又去辞黛玉，黛玉语气含酸，问宝玉为何不去辞宝姐姐，宝玉笑而不答。
贾府家塾只不过一里的路，宝玉和秦钟愈加亲密，同来同往，同起同坐，又因贾母爱惜，留秦钟在贾府居住，不出一个月就全然熟悉了。
秦钟腼腆温柔，怯怯羞羞，有女儿之风，宝玉与他过于亲密的关系招惹来嫌疑，不免别人说三道四制造谣言。
薛蟠偶动龙阳之兴，也来学堂里凑热闹，不过给家塾先生白白交学费而已，本无进取之意，只图结交些契弟，有好几个小学生被他哄上手，其中有两个妩媚风流的，叫香怜和玉爱。大家都对这两个有好感，但迫于薛蟠仗势欺人的压力不好轻举妄动，谁知香怜玉爱两人竟然对宝玉秦钟留有情意。
一日，贾代儒有事告假，留下一句七言对联让学生对，并把学堂托付给贾瑞暂且代为管理，如今薛蟠不大来了，秦钟和香怜就有了机会亲近，俩人借口出小恭出去谈天，说话时巧被金荣撞见，金荣借机敲诈，不给就翻脸，秦钟香怜向贾瑞告金荣，说金荣欺负他们俩。
贾瑞图便宜没行止，拿着香怜作法，金荣更加得意，开始恶意造谣生事，结果却惹毛了一个局外人，名唤贾蔷，系宁府中正派玄孙，父母早亡，跟着贾珍过活，16岁，设计谋怂恿宝玉的书童茗烟和金荣打架，渐渐发展成为群架。
李贵见屋里作反起来，忙去喝住，居中调停，查问金荣来历，最后由金荣赔礼道歉把事态阻止住。
问：为什么这么多的男同性恋？作者何意？`