var data = `黛玉刚到屋里便吐出一口血，晕了过去。醒后神清但易喘。
秋雯告诉贾母，贾母叫王夫人凤姐同去看望。黛玉说老太太白疼了她了，老太太说黛玉若有心病，她也没心肠了，白疼了黛玉了。 众人都忙活着宝玉大婚，甚至没人来探视黛玉，黛玉郁气伤肝，病情日重一日。
薛蝌向薛蟠征求宝钗出嫁的意见，薛蟠很知礼地同意按母亲的意见办。黛玉一日比一日差，以前常有人来看望，但宝玉成亲这几天，就连下人也没有来过。
黛玉见紫鹃一人，诉及心事肺腑之言。此时已是夜里，黛玉让紫鹃递来诗稿，火盆，将一块题诗的白绫绢子和诗稿焚尽，紫鹃抢之不及。
紫鹃见黛玉又病重，找贾母未见，见主子下人都忙着宝玉的婚事，无人管黛玉，更是伤心。待紫鹃回去，黛玉已不好了，忙叫了黛玉的奶妈王奶奶来，王奶奶又请了应回避宝玉喜事的李纨，李纨听说黛玉好不了，急忙过去，黛玉此时已不能说话，李纨忙叫紫鹃换衣衾，说道：“傻丫头,这是什么时候,且只顾哭你的!林姑娘的衣衾还不拿出来给他换上, 还等多早晚呢.难道他个女孩儿家,你还叫他赤身露体精着来光着去吗！”紫鹃听了这句话, 一发止不住痛哭起来。李纨一面也哭,一面着急,一面拭泪。
正忙平儿来了，撒泪见了黛玉。林之孝家的也来了，李纨叫告诉管事的预备林姑娘的后事。林之孝家的欲叫去紫鹃无果，平儿带雪雁去了，叫林之孝家的告诉林大爷办林姑娘的东西。雪雁强抑伤心到贾母凤姐那去，为宝玉婚事，这边也都忙着办喜事了。
宝玉傻傻的以为是林妹妹，待揭了盖头却看到是宝钗，宝玉此时心无主意，自己反以为是梦中了。在确认不是梦，他娶的是宝姑娘后，宝玉旧病复发，更加严重。贾母安慰，直至扶他睡下，一夜无事。
次早，贾政辞了宗祠，过来拜别贾母，远行去了。。。。`